gsm988aa/embedded-and-hardware/applications/STM32CubeIDE/STM32F103RCT6_nRF24L01/nRF24L01/RF24.cpp
/*
 Copyright (C) 2011 J. Coliz <maniacbug@ymail.com>

 This program is free software; you can redistribute it and/or
 modify it under the terms of the GNU General Public License
 version 2 as published by the Free Software Foundation.
 */

#include "nRF24L01.h"
#include "RF24_config.h"
#include "RF24.h"

extern 	SPI_t	_SPI;

/****************************************************************************/

void RF24::csn(bool mode)
{
//    digitalWrite(csn_pin, mode);
//    delayMicroseconds(csDelay);
//    #endif // !defined(RF24_LINUX)

}

/****************************************************************************/

void RF24::ce(bool level)
{
    if (ce_pin != csn_pin)
    {
        //digitalWrite(ce_pin, level);
        _SPI.ce_pin(level);
    }
}

/****************************************************************************/

inline void RF24::beginTransaction()
{
    _SPI.csn_pin(0);
}

/****************************************************************************/

inline void RF24::endTransaction()
{
	_SPI.csn_pin(1);
}

/****************************************************************************/

uint8_t RF24::read_register(uint8_t reg, uint8_t* buf, uint8_t len)
{
    uint8_t status;

    beginTransaction();
    status = _SPI.transfer(R_REGISTER | (REGISTER_MASK & reg));
    while (len--) {
        *buf++ = _SPI.transfer(0xff);
    }
    endTransaction();
    return status;
}

/****************************************************************************/

uint8_t RF24::read_register(uint8_t reg)
{
    uint8_t result;
    beginTransaction();
    _SPI.transfer(R_REGISTER | (REGISTER_MASK & reg));
    result = _SPI.transfer(0xff);
    endTransaction();
    return result;
}

/****************************************************************************/

uint8_t RF24::write_register(uint8_t reg, const uint8_t* buf, uint8_t len)
{
    uint8_t status;

    beginTransaction();
    status = _SPI.transfer(W_REGISTER | (REGISTER_MASK & reg));
    while (len--) {
        _SPI.transfer(*buf++);
    }
    endTransaction();
    return status;
}

/****************************************************************************/

uint8_t RF24::write_register(uint8_t reg, uint8_t value)
{
    uint8_t status;
    beginTransaction();
    status = _SPI.transfer(W_REGISTER | (REGISTER_MASK & reg));
    _SPI.transfer(value);
    endTransaction();
    return status;
}

/****************************************************************************/

uint8_t RF24::write_payload(const void* buf, uint8_t data_len, const uint8_t writeType)
{
    uint8_t status;
    const uint8_t* current = reinterpret_cast<const uint8_t*>(buf);

    data_len = rf24_min(data_len, payload_size);
    uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;
    beginTransaction();
    status = _SPI.transfer(writeType);
    while (data_len--) {
        _SPI.transfer(*current++);
    }
    while (blank_len--) {
        _SPI.transfer(0);
    }
    endTransaction();


    return status;
}

/****************************************************************************/

uint8_t RF24::read_payload(void* buf, uint8_t data_len)
{
    uint8_t status;
    uint8_t* current = reinterpret_cast<uint8_t*>(buf);

    if (data_len > payload_size) {
        data_len = payload_size;
    }
    uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;

    beginTransaction();
    status = _SPI.transfer(R_RX_PAYLOAD);
    while (data_len--) {
        *current++ = _SPI.transfer(0xFF);
    }
    while (blank_len--) {
        _SPI.transfer(0xff);
    }
    endTransaction();

    return status;
}

/****************************************************************************/

uint8_t RF24::flush_rx(void)
{
    return spiTrans(FLUSH_RX);
}

/****************************************************************************/

uint8_t RF24::flush_tx(void)
{
    return spiTrans(FLUSH_TX);
}

/****************************************************************************/

uint8_t RF24::spiTrans(uint8_t cmd)
{

    uint8_t status;

    beginTransaction();
    status = _SPI.transfer(cmd);
    endTransaction();

    return status;
}

/****************************************************************************/

uint8_t RF24::get_status(void)
{
    return spiTrans(RF24_NOP);
}


/****************************************************************************/

RF24::RF24(uint16_t _cepin, uint16_t _cspin, uint32_t _spi_speed)
        :ce_pin(_cepin), csn_pin(_cspin),spi_speed(_spi_speed), p_variant(false), payload_size(32), dynamic_payloads_enabled(false), addr_width(5),
         csDelay(5)//,pipe0_reading_address(0)
{
    pipe0_reading_address[0] = 0;
    if(spi_speed <= 35000){ //Handle old BCM2835 speed constants, default to RF24_SPI_SPEED
      spi_speed = RF24_SPI_SPEED;
    }
}

/****************************************************************************/

void RF24::setChannel(uint8_t channel)
{
    const uint8_t max_channel = 125;
    write_register(RF_CH, rf24_min(channel, max_channel));
}

uint8_t RF24::getChannel()
{

    return read_register(RF_CH);
}

/****************************************************************************/

void RF24::setPayloadSize(uint8_t size)
{
    payload_size = rf24_min(size, 32);
}

/****************************************************************************/

uint8_t RF24::getPayloadSize(void)
{
    return payload_size;
}

/****************************************************************************/

#if !defined(MINIMAL)

static const char rf24_datarate_e_str_0[] PROGMEM = "1MBPS";
static const char rf24_datarate_e_str_1[] PROGMEM = "2MBPS";
static const char rf24_datarate_e_str_2[] PROGMEM = "250KBPS";
static const char * const rf24_datarate_e_str_P[] PROGMEM = {
  rf24_datarate_e_str_0,
  rf24_datarate_e_str_1,
  rf24_datarate_e_str_2,
};
static const char rf24_model_e_str_0[] PROGMEM = "nRF24L01";
static const char rf24_model_e_str_1[] PROGMEM = "nRF24L01+";
static const char * const rf24_model_e_str_P[] PROGMEM = {
  rf24_model_e_str_0,
  rf24_model_e_str_1,
};
